# Функция для страницы «Главная» расположена в модуле
# views.py
# Функция для страницы «Главная» принимает на вход
# DataFrame
# Вспомогательные функции, необходимые для работы функции страницы
# «Главная», расположены в модуле
# utils.py
# Основные функции для генерации JSON-ответов реализуйте в отдельном модуле
# views.py
# Валюты и акции для отображения на веб-страницах задаются в отдельном
# файле пользовательских настроек
# user_settings.json

# Реализуйте набор функций и главную функцию, принимающую
# на вход строку с датой и временем в формате
# YYYY-MM-DD HH:MM:SS
#  и возвращающую JSON-ответ со следующими данными:
#
# Приветствие в формате
# "???"
# , где
# ???
#  — «Доброе утро» / «Добрый день» / «Добрый вечер» / «Доброй ночи»
#  в зависимости от текущего времени.
# По каждой карте:
# последние 4 цифры карты;
# общая сумма расходов;
# кешбэк (1 рубль на каждые 100 рублей).
# Топ-5 транзакций по сумме платежа.
# Курс валют.
# Стоимость акций из S&P500.



